import {Component, HostListener} from '@angular/core';

@Component({
  selector: 'app-site-footer',
  templateUrl: './site-footer.component.html',
  styleUrls: ['./site-footer.component.scss']
})
export class SiteFooterComponent {
  footerInfo = new Map([
    ["Столовый текстиль1", ["Скатерти прямоугольные", "Скатерти круглые", "Скатерти овальные", "Раннеры", "Напероны", "Фуршетные юбки", "Мулетоны"]],
    ["Столовый текстиль2", ["Скатерти прямоугольные", "Скатерти круглые", "Скатерти овальные", "Раннеры", "Напероны", "Фуршетные юбки", "Мулетоны"]],
    ["Столовый текстиль3", ["Скатерти прямоугольные", "Скатерти круглые", "Скатерти овальные", "Раннеры", "Напероны", "Фуршетные юбки", "Мулетоны"]],
    ["Столовый текстиль4", ["Скатерти прямоугольные", "Скатерти круглые", "Скатерти овальные", "Раннеры", "Напероны", "Фуршетные юбки", "Мулетоны"]],
    ["Столовый текстиль5", ["Скатерти прямоугольные", "Скатерти круглые", "Скатерти овальные", "Раннеры", "Напероны", "Фуршетные юбки", "Мулетоны"]],
  ]);

  columns = Array.from(this.footerInfo.entries()).map(([title, items]) => ({ title, items }));

}
